quantummongolia/industrial-iot/esp32_firmware/butluur/src/main.cpp
  if (withCurrents) {
    delay(cfg::FRAME_GAP_MS);
    uint16_t ix[3] = {0, 0, 0};
    r.currentsOk = withRetry([&] {
      return mb.readU16x3(slave, cfg::SPM33_REG_IA, ix);
    });
    if (r.currentsOk) {
      const float k = 0.001f * (float)ctPrimary[slave] / (float)cfg::SPM33_CT_SEC;
      r.currentA = ix[0] * k;
      r.currentB = ix[1] * k;
      r.currentC = ix[2] * k;
    }
  }

  return r;
}

// Totalizer cycle (60с тутам) — зөвхөн нийт идэвхтэй энерги уншина.
Spm33Reading Spm33_readEnergy(Modbus &mb, uint8_t slave) {
  Spm33Reading r;

  uint32_t energyRaw = 0;
  r.energyOk = withRetry(
      [&] { return mb.readU32LowFirst(slave, cfg::SPM33_REG_ENERGY, energyRaw); });
  if (r.energyOk) {
    // 40026 нь primary side kWh-ийг ×0.1-ээр өгдөг (5.1 хүснэгт)
    r.energyKWh = energyRaw * 0.1f;
  }

  return r;
}

// ── Глобал ─────────────────────────────────────────────────────────────
Modbus modbus;
FirebaseData fbData;
FirebaseAuth fbAuth;
FirebaseConfig fbConfig;

bool firebaseReady = false;
unsigned long lastWifiCheck = 0;
unsigned long wifiDisconnectedAt = 0; // 0 = холбоотой; !=0 = тасрахад эхэлсэн агшин
unsigned long lastTotalizerReadTime = 0; // Сүүлд totalizer уншсан агшин (ms)
unsigned long lastHeapLogTime = 0;       // Сүүлд heap-н хэмжээг log хийсэн агшин

unsigned int consecutiveReadFails = 0;
unsigned int totalRecoveryAttempts = 0;

// Connectivity watchdog state — салгагдсан агшнаас хойш хэдий хугацаа өнгөрснийг
// хэмжинэ (0 = одоо холбоотой, асуудалгүй).
unsigned long wifiDownSince = 0;
unsigned long fbNotReadySince = 0;

unsigned long fbNextAllowedAt = 0;
unsigned int fbFailStreak = 0;

// Totalizer утга 1 минутад нэг л шинэчлэгдэх тул хооронд нь cache-д хадгална.
// Анхны boot-д valid биш — эхний амжилттай уншилт хүртэл Firebase-руу бичигдэхгүй.
double cachedWeightT = 0.0;        bool cachedWeightTValid = false;
float  cachedEm03EnergyKWh = 0.0f; bool cachedEm03EnergyValid = false;

void fbOnFailure() {
  fbFailStreak++;
  unsigned long backoff =
      2000UL * (1UL << min((unsigned int)8, fbFailStreak));
  if (backoff > 300000UL)
    backoff = 300000UL;
  fbNextAllowedAt = millis() + backoff;
  Serial.printf("[Firebase] Backoff %lus (fail streak %u)\n", backoff / 1000,
                fbFailStreak);
}

void fbOnSuccess() {
  if (fbFailStreak > 0)
    Serial.println("[Firebase] Recovered");
  fbFailStreak = 0;
  fbNextAllowedAt = 0;
}

bool fbCanUpload() { return (long)(millis() - fbNextAllowedAt) >= 0; }

void recoverModbusBus() {
  totalRecoveryAttempts++;
  Serial.printf("[Recovery] Attempt #%u after %u failed cycles\n",
                totalRecoveryAttempts, consecutiveReadFails);
  if (totalRecoveryAttempts >= cfg::MAX_RECOVERY_ATTEMPTS) {
    // Цэвэр reboot — while(true)+WDT panic нь S3/USB-CDC дээр backtrace-аа гацсан
    // USB порт руу хэвлэхийг оролдоод reboot хүртэл хүрдэггүй. esp_restart() нь
    // panic printer-ээр орохгүй тул заавал найдвартай сэргэнэ.
    Serial.println("[Recovery] Max attempts — clean ESP.restart()");
    Serial.flush();
    delay(100);
    ESP.restart();
  }
  modbus.recover();
  consecutiveReadFails = 0;
  Serial.println("[Recovery] RS485 bus re-initialized");
}

void onWifiEvent(WiFiEvent_t event) {
  switch (event) {
  case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
    Serial.println("[WiFi] Disconnected — attempting auto-reconnect");
    if (wifiDisconnectedAt == 0)
      wifiDisconnectedAt = millis(); // тасралтгүй тасарсан эхний агшныг тэмдэглэнэ
    WiFi.reconnect();
    break;
  case ARDUINO_EVENT_WIFI_STA_GOT_IP:
    Serial.printf("[WiFi] Reconnected — IP: %s\n",
                  WiFi.localIP().toString().c_str());
    wifiDisconnectedAt = 0;
    break;
  default:
    break;
  }
}

void wifiConnect() {
  if (WiFi.status() == WL_CONNECTED)
    return;

  Serial.printf("[WiFi] Connecting to network: %s", WIFI_SSID);
  WiFi.mode(WIFI_STA);
  WiFi.setAutoReconnect(true);
  WiFi.persistent(true);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  unsigned long start = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - start < 15000) {
    delay(500);
    Serial.print(".");
  }

  if (WiFi.status() == WL_CONNECTED) {
    Serial.printf("\n[WiFi] Connected — IP: %s\n",
                  WiFi.localIP().toString().c_str());
  } else {
    Serial.println("\n[WiFi] Connection failed — will retry later");
    WiFi.disconnect(true);
    delay(100);
    WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
  }
}

void firebaseInit() {
  fbConfig.api_key = FIREBASE_API_KEY;
  fbConfig.database_url = FIREBASE_DB_URL;
  fbAuth.user.email = FIREBASE_USER_EMAIL;
  fbAuth.user.password = FIREBASE_USER_PASS;
  fbConfig.token_status_callback = tokenStatusCallback;
  fbData.setBSSLBufferSize(2048, 2048);
  Firebase.begin(&fbConfig, &fbAuth);
  Firebase.reconnectNetwork(true);
  Serial.println("[Firebase] init — authenticating");
}

// ========================== DATA-LED LIVENESS FLIP =========================
// Сул зогссон сенсорын утга өөрчлөгдөхгүй бол Firebase-ийн .on("value")
// listener асдаггүй тул dashboard-ийн ногоон data-LED анивчдаггүй. Үүнийг
// засахын тулд утгыг 2 орноор бөөрөнхийлж, гацсан тохиолдолд 3 дахь орныг
// 0↔1 сэлгэнэ — dashboard 2 орон харуулдаг тул flag үл харагдана. Уншилт
// амжилттай болоход л дуудагдана тул үхсэн сенсор анивчихгүй, stale болно.
// ЗӨВХӨН жижиг утганд (power/weight); totalizer/energy/currents-д ХЭРЭГЛЭХГҮЙ.
struct LiveState { float last2 = NAN; bool flip = false; };
static float liveValue(float v, LiveState &st) {
  float v2 = roundf(v * 100.0f) / 100.0f;
  st.flip = (v2 == st.last2) ? !st.flip : false;
  st.last2 = v2;
  return v2 + (st.flip ? 0.001f : 0.0f);
}
LiveState lvEm03, lvWeight;

// ── Task WDT timeout handler (cfg::WDT_TIMEOUT_S) ─────────────────────────────
// trigger_panic=false тул loop() нь хугацаандаа esp_task_wdt_reset() хийгээгүй үед
// TWDT нь panic үүсгэхгүйгээр энэ weak handler-ийг timer-ISR контекстэд дууддаг.
// Энд ШУУД esp_restart() хийнэ — panic/coredump/serial хэвлэлийн зам бүрэн алгасагдаж,
// "амьд атлаа хөшсөн" (Firebase/Modbus блоклосон, эсвэл panic handler гацсан) төлвөөс
// найдвартай гарна. Энэ нь гадны hardware watchdog-гүйгээр сэргэлтийн гол баталгаа.
extern "C" void esp_task_wdt_isr_user_handler(void) {
  esp_restart();
}

void setup() {
  Serial.begin(115200);
  delay(300);
  Serial.println("\n========= Butluur IoT (S3 N8R2) =========");

  led::begin();
  xTaskCreatePinnedToCore(ledTask, "ledTask", 2048, nullptr, 1, nullptr, 0);

  modbus.begin();

