quantummongolia/industrial-iot/esp32_firmware/butluur/src/main.cpp
  // SPM33 CT primary утгыг боотлох үед уншиж кэшилнэ — P (40011) болон гүйдлийг
  // secondary→primary хөрвүүлэхэд хэрэглэнэ. Унших нь алдвал loop() cycle бүрт
  // амжилттай болтол дахин оролдоно.
  delay(100);
  Spm33_readCtPrimary(modbus, cfg::EM03_SLAVE);

  WiFi.onEvent(onWifiEvent);
  wifiConnect();
  firebaseInit();

  esp_task_wdt_config_t wdtConfig = {.timeout_ms = cfg::WDT_TIMEOUT_S * 1000,
                                     .idle_core_mask = 0,
                                     // panic БИШ: timeout болоход esp_task_wdt_isr_user_handler()-ээс ШУУД esp_restart().
      .trigger_panic = false};
  esp_task_wdt_reconfigure(&wdtConfig);
  esp_task_wdt_add(NULL);

  // Supervisor watchdog task — setup дууссаны дараа эхлүүлнэ (setup-ийн блоклох
  // wifiConnect зэргийг false-restart болгохгүйн тулд). Core 0.
  xTaskCreatePinnedToCore(watchdogTask, "wdog", 2048, nullptr, 1, nullptr, 0);
  Serial.printf("[WDT] Watchdog started — %lu second timeout\n",
                (unsigned long)cfg::WDT_TIMEOUT_S);
}

void loop() {
  g_loopBeat++;           // supervisor task-д "loop ахиж байна" дохио
  esp_task_wdt_reset();
  unsigned long now = millis();

  // ── Long-running stability watchdog ────────────────────────────────
  // Heap fragmentation (Firebase TLS буфер г.м.) удаан ажиллах тусам
  // хуримтлагдаж тогтворгүй болгож болзошгүй. 5 минут тутамд heap-г log
  // хийнэ. Free heap босгоос (20KB) доош унавал эсвэл uptime 24 цаг хэтэрвэл
  // clean restart хийнэ.
  if (now - lastHeapLogTime >= cfg::HEAP_LOG_INTERVAL_MS) {
    lastHeapLogTime = now;
    Serial.printf("[Heap] Free: %u | Min ever: %u | Uptime: %lus\n",
                  ESP.getFreeHeap(), ESP.getMinFreeHeap(), now / 1000);
  }
  if (ESP.getFreeHeap() < cfg::MIN_FREE_HEAP_BYTES) {
    Serial.printf("[Stability] Free heap %u < %u — restarting\n",
                  ESP.getFreeHeap(), cfg::MIN_FREE_HEAP_BYTES);
    delay(200);
    ESP.restart();
  }
  if (now >= cfg::MAX_UPTIME_MS) {
    Serial.println("[Stability] Reached 24h uptime — scheduled restart");
    delay(200);
    ESP.restart();
  }

  // ---- Connectivity watchdog ----
  // WiFi эсвэл Firebase нь cfg::MAX_OFFLINE_MS-ээс удаан салгагдвал цэвэр reboot.
  // WiFi буцаж ирэхэд / сенсор сэргэхэд төхөөрөмж 'бүр мөсөн алга' болохгүй,
  // заавал өөрөө сэргэх баталгаа. Firebase.ready()-г цикл бүрт дуудах нь
  // token-refresh-ийг тасралтгүй ажиллуулж бас тустай.
  if (WiFi.status() == WL_CONNECTED) {
    wifiDownSince = 0;
  } else if (wifiDownSince == 0) {
    wifiDownSince = now;
  } else if (now - wifiDownSince >= cfg::MAX_OFFLINE_MS) {
    Serial.println("[Watchdog] WiFi offline too long — clean restart");
    Serial.flush();
    delay(200);
    ESP.restart();
  }

  if (WiFi.status() == WL_CONNECTED && !Firebase.ready()) {
    if (fbNotReadySince == 0) {
      fbNotReadySince = now;
    } else if (now - fbNotReadySince >= cfg::MAX_OFFLINE_MS) {
      Serial.println("[Watchdog] Firebase not ready too long — clean restart");
      Serial.flush();
      delay(200);
      ESP.restart();
    }
  } else {
    fbNotReadySince = 0;
  }

  // ---- Firebase delivery watchdog ----
  // WiFi асан, Firebase.ready()==true мөртөө бичилт сервер хүрэхгүй (token хүчинтэй ч
  // доорх TCP/TLS session үхсэн "дүлий" төлөв) бол дээрх !Firebase.ready() болзол
  // ХЭЗЭЭ Ч барихгүй. Иймд сүүлийн амжилттай Firebase контактаас MAX_OFFLINE_MS
  // хэтэрвэл цэвэр reset хийж шинээр холбогдоно.
  if (firebaseReady && WiFi.status() == WL_CONNECTED &&
      ota::lastContactMs() != 0 &&
      now - ota::lastContactMs() >= cfg::MAX_OFFLINE_MS) {
    Serial.println("[Watchdog] Firebase delivery stalled — clean restart");
    Serial.flush();
    delay(200);
    ESP.restart();
  }

  // WiFi.reconnect() / auto-reconnect зарим тохиолдолд бодит сүлжээ сэргэсэн ч
  // chip-ийн WiFi stack хатуу "stuck" болсон үед амжилтгүй хэвээр үлддэг —
  // үүнийг зөвхөн бүрэн restart л засдаг тул threshold давсан бол reboot хийнэ.
  if (wifiDisconnectedAt != 0 &&
      now - wifiDisconnectedAt >= cfg::WIFI_DISCONNECT_RESTART_MS) {
    Serial.println("[Stability] WiFi 5+ минут тасархад — restarting");
    delay(200);
    ESP.restart();
  }

  if (WiFi.status() != WL_CONNECTED &&
      now - lastWifiCheck >= cfg::WIFI_RETRY_MS) {
    lastWifiCheck = now;
    Serial.println("[WiFi] retry — async reconnect");
    WiFi.reconnect();
  }

  static unsigned long lastPoll = 0;
  if (now - lastPoll < cfg::POLL_MS)
    return;
  lastPoll = now;

  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("[WiFi] not connected");
    led::setMode(led::SLOW_RED);
    return;
  }

  // Boot үед уншиж чадаагүй CT primary-г дахин оролдоно.
  if (!ctPrimaryKnown[cfg::EM03_SLAVE]) {
    Spm33_readCtPrimary(modbus, cfg::EM03_SLAVE);
    delay(cfg::FRAME_GAP_MS);
  }

  // Цикл бүрд flow-cycle эсвэл totalizer-cycle гэсэн 2 төрлийн нэг нь явна.
  // RS485 bus-н ачааллыг бууруулж, totalizer-ийг тусад нь 1 минутын циклд уншина.
  // Boot-ийн дараа нэг удаа totalizer-ийг шууд уншиж cache-г бөглөнө.
  bool totalizerCycle = (lastTotalizerReadTime == 0) ||
                        (now - lastTotalizerReadTime >= cfg::TOTALIZER_INTERVAL_MS);

  // Энэ цикл-д Firebase upload руу очих утгууд (flow cycle-ийнх)
  float flow = 0;
  bool flowOk = false;
  Spm33Reading em03;

  // Totalizer cycle-ийн төлөв
  double weightT = 0;
  bool weightOk = false;

  if (totalizerCycle) {
    // ── Totalizer cycle: жингийн нийт жин + EM03 энерги
    lastTotalizerReadTime = now;
    Serial.println("[Cycle] Totalizer read (1 min interval)");

    weightOk = withRetry(
        [&] { return modbus.readDouble(cfg::SCALE_SLAVE, cfg::REG_WEIGHT_T, weightT); });
    if (weightOk) { cachedWeightT = weightT; cachedWeightTValid = true; }
    delay(cfg::FRAME_GAP_MS);

    em03 = Spm33_readEnergy(modbus, cfg::EM03_SLAVE);
    if (em03.energyOk) { cachedEm03EnergyKWh = em03.energyKWh; cachedEm03EnergyValid = true; }
    delay(cfg::FRAME_GAP_MS);

    Serial.printf("[Totalizer] Weight:%s EM03:%s\n",
                  weightOk ? String(weightT, 3).c_str() : "#",
                  em03.energyOk ? String(em03.energyKWh, 1).c_str() : "#");
  } else {
    // ── Flow cycle: жингийн урсгал + EM03 power + currents
    flowOk = withRetry(
        [&] { return modbus.readFloat(cfg::SCALE_SLAVE, cfg::REG_FLOW, flow); });
    delay(cfg::FRAME_GAP_MS);

    em03 = Spm33_readPower(modbus, cfg::EM03_SLAVE, true);
    delay(cfg::FRAME_GAP_MS);

