quantummongolia/industrial-iot/esp32_firmware/butluur/src/main.cpp
    Serial.printf("[Flow] Scale:%s EM03:%s\n",
                  flowOk ? String(flow, 2).c_str() : "#",
                  em03.powerOk ? String(em03.powerKW, 2).c_str() : "#");
  }

  // ── Алдаа escalate ──────────────────────────────────────────────
  bool anyOk = flowOk || weightOk || em03.powerOk || em03.energyOk ||
               em03.currentsOk;
  if (anyOk) {
    consecutiveReadFails = 0;
    totalRecoveryAttempts = 0;
  } else {
    consecutiveReadFails++;
    if (consecutiveReadFails >= cfg::MAX_CONSECUTIVE_FAILS)
      recoverModbusBus();
  }

  // ── Firebase upload — /butluur ба /energy_meters subtree-үүдийг тус тусад нь
  // жижиг updateNode-оор бичнэ (rules engine-д бүх замыг шалгуулахаас сэргийлнэ).
  if (!fbCanUpload()) {
    led::setMode(led::SLOW_RED);
    return;
  }
  if (!Firebase.ready()) {
    led::setMode(led::SLOW_RED);
    return;
  }
  if (!firebaseReady) {
    firebaseReady = true;
    Serial.println("[Firebase] ready");
    ota::begin(&fbData);  // DEVICE_ID register + командын stream нээх
  }

  // ─ Subtree 1: /butluur ─────────────────────────────────────────────
  bool butluurOk = true;
  bool butluurAny = false;
  {
    FirebaseJson j;
    if (totalizerCycle) {
      // Totalizer cycle: жингийн нийт жин (тонн, t)
      if (weightOk) {
        j.set("cumulative_t", cachedWeightT);
        butluurAny = true;
      }
    } else {
      // Flow cycle: жингийн урсгал
      if (flowOk) { j.set("weight_rate", liveValue(flow, lvWeight)); butluurAny = true; }
    }
    if (butluurAny) {
      j.set("last_updated", (int)(millis() / 1000));
      butluurOk = Firebase.RTDB.updateNodeSilent(&fbData, "/butluur", &j);
      if (!butluurOk)
        Serial.printf("[Firebase] /butluur ERROR: %s\n",
                      fbData.errorReason().c_str());
    }
  }

  // ─ Subtree 2: /energy_meters/em03 ──────────────────────────────────
  // Flow cycle: power + currents (instantaneous утгууд)
  // Totalizer cycle: total_energy_kwh (cumulative утгууд)
  bool emOk = true;
  bool emAny = false;
  {
    FirebaseJson j;
    if (totalizerCycle) {
      if (em03.energyOk) {
        j.set("em03/total_energy_kwh", em03.energyKWh);
        emAny = true;
      }
    } else {
      if (em03.powerOk) {
        j.set("em03/power_kw", liveValue(em03.powerKW, lvEm03));
        emAny = true;
      }
      if (em03.currentsOk) {
        j.set("em03/current_a", em03.currentA);
        j.set("em03/current_b", em03.currentB);
        j.set("em03/current_c", em03.currentC);
        emAny = true;
      }
    }
    if (emAny) {
      emOk = Firebase.RTDB.updateNodeSilent(&fbData, "/energy_meters", &j);
      if (!emOk)
        Serial.printf("[Firebase] /energy_meters ERROR: %s\n",
                      fbData.errorReason().c_str());
    }
  }

  if (!butluurAny && !emAny) {
    led::setMode(led::SLOW_RED);
    return;
  }

  if (butluurOk && emOk) {
    Serial.println("[Firebase] Updated");
    fbOnSuccess();
    ota::noteFbSuccess(); // delivery watchdog-ийн \"амьд\" тэмдэг
    led::setMode(led::OFF);
    led::pulse();
  } else {
    fbOnFailure();
    led::setMode(led::SLOW_RED);
  }

  // OTA heartbeat + self-test gate (амжилттай upload бүрд +1)
  ota::loop(&fbData, butluurOk && emOk);
}
